/* З №2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
Console.WriteLine("Введите первое число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int num2 = Convert.ToInt32(Console.ReadLine());
if (num1<num2)
{
    int max = num2;
    Console.Write("max = ");
    Console.Write(max);
   }
else
{
    int max = num1;
    Console.WriteLine("max = ");
    Console.Write(max);
}
З №4
Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
*/




